// Lab_03_1.cpp
// <Павлюк Максим Леонідович>
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.

#include <iostream>
#include <cmath> 

int main() {
    double x; // вхідний параметр
    double y; // результат обчислення виразу
    double A; // проміжний результат - функціонально стала частина виразу
    double B; // проміжний результат - функціонально змінна частина виразу

  
    std::cout << "x =  ";
    std::cin >> x;

    // Обчислення сталої частини виразу A
    A = 4.95 * pow(x, 2);

    // Спосіб 1: розгалуження в скороченій формі
    if (x < -3.5) {
        B = 4 + pow(x, -2);  
    }
    else if (x >= -3.5 && x < 1) {
        B = tan((3.5 + x) / 5); 
    }
    else {
        B = sin(3 * x) - cos(x); 
    }

    // Обчислення значення y
    y = A + B;

    // Виведення результату
    std::cout << "1) y = " << y << std::endl;

    // Спосіб 2: розгалуження в повній формі
    if (x < -3.5) {
        B = 4 + pow(x, -2);  // вираз1
    }
    else {
        if (x >= -3.5 && x < 1) {
            B = tan((3.5 + x) / 5);  // вираз2
        }
        else {
            B = sin(3 * x) - cos(x);  // вираз3
        }
    }

    // Обчислення значення y для другого способу
    y = A + B;

    // Виведення результату для другого способу
    std::cout << "2) y = " << y << std::endl;
   
    return 0;
}
